; domain
;; Woodworking
;;

(define (domain woodworking)
  (:requirements :typing :action-costs)
  (:types
      acolour awood woodobj machine 
      surface treatmentstatus
      aboardsize apartsize - object
      highspeed-saw glazer grinder immersion-varnisher
      planer saw spray-varnisher - machine
      board part - woodobj)

  (:constants
              verysmooth smooth rough - surface
              varnished glazed untreated colourfragments - treatmentstatus
              natural - acolour
              small medium large - apartsize)

  (:predicates 
            (unused ?obj - part)
            (available ?obj - woodobj)

            (surface-condition ?obj - woodobj ?surface - surface)
            (treatment ?obj - part ?treatment - treatmentstatus)
            (colour ?obj - part ?colour - acolour)
            (wood ?obj - woodobj ?wood - awood)
            (boardsize ?board - board ?size - aboardsize)
            (goalsize ?part - part ?size - apartsize)
            (boardsize-successor ?size1 ?size2 - aboardsize)

            (in-highspeed-saw ?b - board ?m - highspeed-saw)
            (empty ?m - highspeed-saw)
            (has-colour ?machine - machine ?colour - acolour)
            (contains-part ?b - board ?p - part)
            (grind-treatment-change ?old ?new - treatmentstatus)
            (is-smooth ?surface - surface))
      
  (:functions (total-cost) - number
            (spray-varnish-cost ?obj - part) - number
            (glaze-cost ?obj - part) - number
            (grind-cost ?obj - part) - number
            (plane-cost ?obj - part) - number)

  (:action do-immersion-varnish
    :parameters (?x - part ?m - immersion-varnisher 
                 ?newcolour - acolour ?surface - surface)
    :precondition (and
            (available ?x)
            (has-colour ?m ?newcolour)
            (surface-condition ?x ?surface)
            (is-smooth ?surface)
            (treatment ?x untreated))
    :effect (and
            (increase (total-cost) 10)
            (not (treatment ?x untreated))
            (treatment ?x varnished)
            (not (colour ?x natural))
            (colour ?x ?newcolour)))

  (:action do-spray-varnish
    :parameters (?x - part ?m - spray-varnisher 
                 ?newcolour - acolour ?surface - surface)
    :precondition (and
            (available ?x)
            (has-colour ?m ?newcolour)
            (surface-condition ?x ?surface)
            (is-smooth ?surface)
            (treatment ?x untreated))
    :effect (and 
            (increase (total-cost) (spray-varnish-cost ?x))
            (not (treatment ?x untreated))
            (treatment ?x varnished)
            (not (colour ?x natural))
            (colour ?x ?newcolour)))

  (:action do-glaze
    :parameters (?x - part ?m - glazer 
                 ?newcolour - acolour)
    :precondition (and
            (available ?x)
            (has-colour ?m ?newcolour)
            (treatment ?x untreated))
    :effect (and 
            (increase (total-cost) (glaze-cost ?x))
            (not (treatment ?x untreated))
            (treatment ?x glazed)
            (not (colour ?x natural))
            (colour ?x ?newcolour)))

  (:action do-grind
    :parameters (?x - part ?m - grinder ?oldsurface - surface
                 ?oldcolour - acolour 
                 ?oldtreatment ?newtreatment - treatmentstatus) 
    :precondition (and 
            (available ?x)
            (surface-condition ?x ?oldsurface)
            (is-smooth ?oldsurface)
            (colour ?x ?oldcolour)
            (treatment ?x ?oldtreatment)
            (grind-treatment-change ?oldtreatment ?newtreatment))
    :effect (and
            (increase (total-cost) (grind-cost ?x))
            (not (surface-condition ?x ?oldsurface))
            (surface-condition ?x verysmooth)
            (not (treatment ?x ?oldtreatment))
            (treatment ?x ?newtreatment)
            (not (colour ?x ?oldcolour))
            (colour ?x natural)))

  (:action do-plane
    :parameters (?x - part ?m - planer ?oldsurface - surface
                 ?oldcolour - acolour ?oldtreatment - treatmentstatus) 
    :precondition (and 
            (available ?x)
            (surface-condition ?x ?oldsurface)
            (treatment ?x ?oldtreatment)
            (colour ?x ?oldcolour))
    :effect (and
            (increase (total-cost) (plane-cost ?x))
            (not (surface-condition ?x ?oldsurface))
            (surface-condition ?x smooth)
            (not (treatment ?x ?oldtreatment))
            (treatment ?x untreated)
            (not (colour ?x ?oldcolour))
            (colour ?x natural)))

  (:action load-highspeed-saw
    :parameters (?b - board ?m - highspeed-saw)
    :precondition (and
            (empty ?m)
            (available ?b))
    :effect (and
            (increase (total-cost) 30)
            (not (available ?b))
            (not (empty ?m))
            (in-highspeed-saw ?b ?m)))
            
  (:action unload-highspeed-saw
    :parameters (?b - board ?m - highspeed-saw)
    :precondition (in-highspeed-saw ?b ?m)
    :effect (and
            (increase (total-cost) 10)
            (available ?b)
            (not (in-highspeed-saw ?b ?m))
            (empty ?m)))
            
  (:action cut-board-small
    :parameters (?b - board ?p - part ?m - highspeed-saw ?w - awood
                 ?surface - surface ?size_before ?size_after - aboardsize)
    :precondition (and
            (unused ?p)
            (goalsize ?p small)
            (in-highspeed-saw ?b ?m)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?size_before))
    :effect (and
            (increase (total-cost) 10)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural)
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))

  (:action cut-board-medium
    :parameters (?b - board ?p - part ?m - highspeed-saw ?w - awood
                 ?surface - surface 
                 ?size_before ?s1 ?size_after - aboardsize)
    :precondition (and
            (unused ?p)
            (goalsize ?p medium)
            (in-highspeed-saw ?b ?m)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?s1)
            (boardsize-successor ?s1 ?size_before))
    :effect (and
            (increase (total-cost) 10)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural)
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))

  (:action cut-board-large
    :parameters (?b - board ?p - part ?m - highspeed-saw ?w - awood
                 ?surface - surface 
                 ?size_before ?s1 ?s2 ?size_after - aboardsize)
    :precondition (and
            (unused ?p)
            (goalsize ?p large)
            (in-highspeed-saw ?b ?m)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?s1)
            (boardsize-successor ?s1 ?s2)
            (boardsize-successor ?s2 ?size_before))
    :effect (and
            (increase (total-cost) 10)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural)
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))

  (:action do-saw-small
    :parameters (?b - board ?p - part ?m - saw ?w - awood
                 ?surface - surface ?size_before ?size_after - aboardsize) 
    :precondition (and 
            (unused ?p)
            (goalsize ?p small)
            (available ?b)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?size_before))
    :effect (and
            (increase (total-cost) 30)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural) 
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))

  (:action do-saw-medium
    :parameters (?b - board ?p - part ?m - saw ?w - awood
                 ?surface - surface 
                 ?size_before ?s1 ?size_after - aboardsize) 
    :precondition (and 
            (unused ?p)
            (goalsize ?p medium)
            (available ?b)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?s1)
            (boardsize-successor ?s1 ?size_before))
    :effect (and
            (increase (total-cost) 30)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural) 
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))

  (:action do-saw-large
    :parameters (?b - board ?p - part ?m - saw ?w - awood
                 ?surface - surface 
                 ?size_before ?s1 ?s2 ?size_after - aboardsize) 
    :precondition (and 
            (unused ?p)
            (goalsize ?p large)
            (available ?b)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?s1)
            (boardsize-successor ?s1 ?s2)
            (boardsize-successor ?s2 ?size_before))
    :effect (and
            (increase (total-cost) 30)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural) 
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))
)

; problem
; woodworking task with 10 parts and 200% wood
; Machines:
;   2 highspeed-saw
;   2 glazer
;   2 grinder
;   2 immersion-varnisher
;   2 planer
;   2 saw
;   2 spray-varnisher

(define (problem wood-prob)
  (:domain woodworking)
  (:objects
    highspeed-saw0 highspeed-saw1 - highspeed-saw
    glazer0 glazer1 - glazer
    grinder0 grinder1 - grinder
    immersion-varnisher0 immersion-varnisher1 - immersion-varnisher
    planer0 planer1 - planer
    saw0 saw1 - saw
    spray-varnisher0 spray-varnisher1 - spray-varnisher
    mauve black red white blue green - acolour
    mahogany pine - awood
    p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 - part
    b0 b1 b2 b3 b4 - board
    s0 s1 s2 s3 s4 s5 s6 s7 s8 s9 - aboardsize
  )
  (:init
    (grind-treatment-change varnished colourfragments)
    (grind-treatment-change glazed untreated)
    (grind-treatment-change untreated untreated)
    (grind-treatment-change colourfragments untreated)
    (is-smooth smooth)
    (is-smooth verysmooth)
    (= (total-cost) 0)
    (boardsize-successor s0 s1)
    (boardsize-successor s1 s2)
    (boardsize-successor s2 s3)
    (boardsize-successor s3 s4)
    (boardsize-successor s4 s5)
    (boardsize-successor s5 s6)
    (boardsize-successor s6 s7)
    (boardsize-successor s7 s8)
    (boardsize-successor s8 s9)
    (empty highspeed-saw0)
    (empty highspeed-saw1)
    (has-colour glazer0 natural)
    (has-colour glazer1 blue)
    (has-colour glazer1 natural)
    (has-colour immersion-varnisher0 blue)
    (has-colour immersion-varnisher0 green)
    (has-colour immersion-varnisher0 black)
    (has-colour immersion-varnisher0 natural)
    (has-colour immersion-varnisher1 blue)
    (has-colour immersion-varnisher1 green)
    (has-colour immersion-varnisher1 black)
    (has-colour immersion-varnisher1 natural)
    (has-colour spray-varnisher0 blue)
    (has-colour spray-varnisher0 green)
    (has-colour spray-varnisher0 black)
    (has-colour spray-varnisher0 natural)
    (has-colour spray-varnisher1 blue)
    (has-colour spray-varnisher1 green)
    (has-colour spray-varnisher1 black)
    (has-colour spray-varnisher1 natural)
    (available p0)
    (treatment p0 glazed)
    (surface-condition p0 smooth)
    (wood p0 mahogany)
    (colour p0 mauve)
    (goalsize p0 large)
    (= (spray-varnish-cost p0) 15)
    (= (glaze-cost p0) 20)
    (= (grind-cost p0) 45)
    (= (plane-cost p0) 30)
    (unused p1)
    (goalsize p1 large)
    (= (spray-varnish-cost p1) 15)
    (= (glaze-cost p1) 20)
    (= (grind-cost p1) 45)
    (= (plane-cost p1) 30)
    (unused p2)
    (goalsize p2 medium)
    (= (spray-varnish-cost p2) 10)
    (= (glaze-cost p2) 15)
    (= (grind-cost p2) 30)
    (= (plane-cost p2) 20)
    (unused p3)
    (goalsize p3 large)
    (= (spray-varnish-cost p3) 15)
    (= (glaze-cost p3) 20)
    (= (grind-cost p3) 45)
    (= (plane-cost p3) 30)
    (unused p4)
    (goalsize p4 medium)
    (= (spray-varnish-cost p4) 10)
    (= (glaze-cost p4) 15)
    (= (grind-cost p4) 30)
    (= (plane-cost p4) 20)
    (unused p5)
    (goalsize p5 small)
    (= (spray-varnish-cost p5) 5)
    (= (glaze-cost p5) 10)
    (= (grind-cost p5) 15)
    (= (plane-cost p5) 10)
    (available p6)
    (treatment p6 glazed)
    (surface-condition p6 smooth)
    (wood p6 mahogany)
    (colour p6 blue)
    (goalsize p6 small)
    (= (spray-varnish-cost p6) 5)
    (= (glaze-cost p6) 10)
    (= (grind-cost p6) 15)
    (= (plane-cost p6) 10)
    (unused p7)
    (goalsize p7 small)
    (= (spray-varnish-cost p7) 5)
    (= (glaze-cost p7) 10)
    (= (grind-cost p7) 15)
    (= (plane-cost p7) 10)
    (unused p8)
    (goalsize p8 large)
    (= (spray-varnish-cost p8) 15)
    (= (glaze-cost p8) 20)
    (= (grind-cost p8) 45)
    (= (plane-cost p8) 30)
    (unused p9)
    (goalsize p9 medium)
    (= (spray-varnish-cost p9) 10)
    (= (glaze-cost p9) 15)
    (= (grind-cost p9) 30)
    (= (plane-cost p9) 20)
    (boardsize b0 s7)
    (wood b0 pine)
    (surface-condition b0 rough)
    (available b0)
    (boardsize b1 s8)
    (wood b1 pine)
    (surface-condition b1 smooth)
    (available b1)
    (boardsize b2 s9)
    (wood b2 pine)
    (surface-condition b2 smooth)
    (available b2)
    (boardsize b3 s6)
    (wood b3 pine)
    (surface-condition b3 smooth)
    (available b3)
    (boardsize b4 s4)
    (wood b4 mahogany)
    (surface-condition b4 rough)
    (available b4)
  )
  (:goal
    (and
    (available p0)
    (colour p0 blue)
    (wood p0 mahogany)
    (treatment p0 varnished)
    (surface-condition p0 verysmooth)
    (available p1)
    (wood p1 pine)
    (treatment p1 varnished)
    (colour p1 natural)
    (available p2)
    (treatment p2 varnished)
    (colour p2 natural)
    (surface-condition p2 smooth)
    (available p3)
    (treatment p3 varnished)
    (colour p3 green)
    (available p4)
    (colour p4 black)
    (wood p4 pine)
    (treatment p4 varnished)
    (available p5)
    (wood p5 mahogany)
    (treatment p5 varnished)
    (colour p5 black)
    (surface-condition p5 smooth)
    (available p6)
    (treatment p6 glazed)
    (colour p6 natural)
    (available p7)
    (treatment p7 varnished)
    (surface-condition p7 verysmooth)
    (available p8)
    (wood p8 pine)
    (treatment p8 glazed)
    (available p9)
    (wood p9 pine)
    (colour p9 blue)
    (surface-condition p9 verysmooth)
    )
  )
  (:metric minimize (total-cost))
)

; plan
1. (do-saw-small b1 p7 saw0 pine smooth s8 s7)
   deleted: (unused p7)
   added: (available p7) (wood p7 pine) (surface-condition p7 smooth) (colour p7 natural) (treatment p7 untreated) (boardsize b1 s7)
   goals met: 5 of 38
2. (do-saw-medium b1 p9 saw0 pine smooth s7 s6 s5)
   deleted: (unused p9)
   added: (available p9) (wood p9 pine) (surface-condition p9 smooth) (colour p9 natural) (treatment p9 untreated) (boardsize b1 s5)
   goals met: 7 of 38
3. (do-saw-large b1 p1 saw0 pine smooth s5 s3 s4 s2)
   deleted: (unused p1)
   added: (available p1) (wood p1 pine) (surface-condition p1 smooth) (colour p1 natural) (treatment p1 untreated) (boardsize b1 s2)
   goals met: 10 of 38
4. (do-saw-large b0 p8 saw0 pine rough s7 s5 s6 s4)
   deleted: (unused p8)
   added: (available p8) (wood p8 pine) (surface-condition p8 rough) (colour p8 natural) (treatment p8 untreated) (boardsize b0 s4)
   goals met: 12 of 38
5. (do-grind p9 grinder0 smooth natural untreated untreated)
   deleted: (surface-condition p9 smooth)
   added: (surface-condition p9 verysmooth)
   goals met: 13 of 38
6. (do-grind p7 grinder0 smooth natural untreated untreated)
   deleted: (surface-condition p7 smooth)
   added: (surface-condition p7 verysmooth)
   goals met: 14 of 38
7. (do-grind p6 grinder0 smooth blue glazed untreated)
   deleted: (surface-condition p6 smooth) (treatment p6 glazed) (colour p6 blue)
   added: (surface-condition p6 verysmooth) (treatment p6 untreated) (colour p6 natural)
   goals met: 14 of 38
8. (do-grind p0 grinder0 smooth mauve glazed untreated)
   deleted: (surface-condition p0 smooth) (treatment p0 glazed) (colour p0 mauve)
   added: (surface-condition p0 verysmooth) (treatment p0 untreated) (colour p0 natural)
   goals met: 15 of 38
9. (do-glaze p9 glazer1 blue)
   deleted: (treatment p9 untreated) (colour p9 natural)
   added: (treatment p9 glazed) (colour p9 blue)
   goals met: 16 of 38
10. (do-glaze p8 glazer0 natural)
   deleted: (treatment p8 untreated)
   added: (treatment p8 glazed)
   goals met: 17 of 38
11. (do-glaze p6 glazer0 natural)
   deleted: (treatment p6 untreated)
   added: (treatment p6 glazed)
   goals met: 18 of 38
12. (do-immersion-varnish p0 immersion-varnisher0 blue verysmooth)
   deleted: (treatment p0 untreated) (colour p0 natural)
   added: (treatment p0 varnished) (colour p0 blue)
   goals met: 20 of 38
13. (do-immersion-varnish p1 immersion-varnisher0 natural smooth)
   deleted: (treatment p1 untreated)
   added: (treatment p1 varnished)
   goals met: 21 of 38
14. (do-immersion-varnish p7 immersion-varnisher0 black verysmooth)
   deleted: (treatment p7 untreated) (colour p7 natural)
   added: (treatment p7 varnished) (colour p7 black)
   goals met: 22 of 38
15. (do-saw-large b2 p3 saw0 pine smooth s9 s7 s8 s6)
   deleted: (unused p3)
   added: (available p3) (wood p3 pine) (surface-condition p3 smooth) (colour p3 natural) (treatment p3 untreated) (boardsize b2 s6)
   goals met: 23 of 38
16. (do-immersion-varnish p3 immersion-varnisher0 green smooth)
   deleted: (treatment p3 untreated) (colour p3 natural)
   added: (treatment p3 varnished) (colour p3 green)
   goals met: 25 of 38
17. (do-saw-medium b1 p2 saw0 pine smooth s2 s1 s0)
   deleted: (unused p2)
   added: (available p2) (wood p2 pine) (surface-condition p2 smooth) (colour p2 natural) (treatment p2 untreated) (boardsize b1 s0)
   goals met: 28 of 38
18. (do-immersion-varnish p2 immersion-varnisher0 natural smooth)
   deleted: (treatment p2 untreated)
   added: (treatment p2 varnished)
   goals met: 29 of 38
19. (do-saw-medium b2 p4 saw0 pine smooth s6 s5 s4)
   deleted: (unused p4)
   added: (available p4) (wood p4 pine) (surface-condition p4 smooth) (colour p4 natural) (treatment p4 untreated) (boardsize b2 s4)
   goals met: 31 of 38
20. (do-immersion-varnish p4 immersion-varnisher0 black smooth)
   deleted: (treatment p4 untreated) (colour p4 natural)
   added: (treatment p4 varnished) (colour p4 black)
   goals met: 33 of 38
21. (do-saw-small b4 p5 saw0 mahogany rough s4 s3)
   deleted: (unused p5)
   added: (available p5) (wood p5 mahogany) (surface-condition p5 rough) (colour p5 natural) (treatment p5 untreated) (boardsize b4 s3)
   goals met: 35 of 38
22. (do-plane p5 planer0 rough natural untreated)
   deleted: (surface-condition p5 rough)
   added: (surface-condition p5 smooth)
   goals met: 36 of 38
23. (do-immersion-varnish p5 immersion-varnisher0 black smooth)
   deleted: (treatment p5 untreated) (colour p5 natural)
   added: (treatment p5 varnished) (colour p5 black)
   goals met: 38 of 38
